      * ----------------------------------------------------------------
      * Generated copybook for COM-REPLY
      * ----------------------------------------------------------------
       01  COM-REPLY.
           02  currencySymbol PIC X(32) DISPLAY.
           02  displayCountry PIC X(32) DISPLAY.
           02  displayLanguage PIC X(32) DISPLAY.
           02  formattedDate PIC X(32) DISPLAY.
           02  formattedDecimalNumber PIC X(32) DISPLAY.
           02  serverCultureInfo.
             03  cultureCode PIC X(32) DISPLAY.
             03  displayCountry0 PIC X(32) DISPLAY.
             03  displayLanguage0 PIC X(32) DISPLAY.
