       PROGRAM-ID. DPLARCHT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-DBCS               PIC GGBBGG DISPLAY.
       PROCEDURE DIVISION.
           GOBACK.
