       PROGRAM-ID. DPLARCHT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NATIONAL             PIC N(10).
       PROCEDURE DIVISION.
           GOBACK.
