       PROGRAM-ID. DPLARCHT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NATIVE-BINARY             PIC S9(5) COMP.
       PROCEDURE DIVISION.
           GOBACK.
