//P390FXMC   JOB  (ACCT#),'FADY',
//*          RESTART=REFRESH,
//           MSGCLASS=X,NOTIFY=&SYSUID,PRTY=14,REGION=0M
//*-------------------------------------------------------
//* COMPILES LSLNKCTN
//*-------------------------------------------------------
//SBPROCS JCLLIB ORDER=DFH310.CICS.SDFHPROC
//CMPCON  EXEC DFHYITDL,PROGLIB='P390.LEGSTAR.@VERSION@.LOAD',
//             DSCTLIB='DFH310.CICS.SDFHC370',
//             LE370HLQ=CEE,
//             INDEX='DFH310.CICS',
//             CPARM='RENT,SOURCE,LIST,OFFSET,LONGNAME,DLL',
//             PPARM=DLLNAME(LSLNKCTN),
//             COMPHLQ=CBC,
//             OUTC='*'
//*
//*-------------------------------------------------------
//* CICS TRANSLATION SUBSTITUTIONS
//*-------------------------------------------------------
//TRN.SYSIN DD DISP=SHR,DSN=P390.LEGSTAR.@VERSION@.C370(LSLNKCTN)
//*-------------------------------------------------------
//* COMPILE SUBSTITUTIONS
//*-------------------------------------------------------
//C.SYSLIB  DD
// DD
// DD
// DD
// DD
// DD DISP=SHR,DSN=P390.LEGSTAR.@VERSION@.H370
//*-------------------------------------------------------
//* PRE-LINK SUBSTITUTIONS
//*-------------------------------------------------------
//PLKED.SYSIN  DD
//             DD DISP=SHR,DSN=P390.LEGSTAR.@VERSION@.DECK(LSCOMLOG)
//PLKED.SYSDEFSD DD DSN=P390.LEGSTAR.@VERSION@.DECK(LSLNKCTN),DISP=SHR
//*-------------------------------------------------------
//* LINK SUBSTITUTIONS
//*-------------------------------------------------------
//LKED.SYSLIB DD
//     DD
//     DD DISP=SHR,DSN=P390.LEGSTAR.@VERSION@.LOAD
//LKED.SYSLMOD DD DSN=P390.LEGSTAR.@VERSION@.LOAD(LSLNKCTN),DISP=SHR
//