      * ----------------------------------------------------------------
      * Generated copybook for CUSTOMER-DATA
      * ----------------------------------------------------------------
       01  CUSTOMER-DATA.
           05  CUSTOMER-DATA-FIRST PIC X(160) VALUE 'In COBOL, alphanume
      -    'ric literals cannot exceed one hundred and sixty characters.
      -    ' This is unlike most recent languages which do not put limit
      -    's on strings length .'.
           05  CUSTOMER-DATA-SECOND PIC X(160) VALUE 'In COBOL, alphanum
      -    'eric literals cannot exceed one hundred and sixty characters
      -    '. This is unlike most recent languages which do not put limi
      -    'ts on strings length .'.
