      * ----------------------------------------------------------------
      * Generated copybook for TOP-ITEM
      * ----------------------------------------------------------------
       01  TOP-ITEM.
           05  DEPTH-1-ITEM-1.
               10  DEPTH-2-ITEM-1 PIC X.
               10  DEPTH-2-ITEM-2 PIC 9.
           05  DEPTH-1-ITEM-2.
               10  DEPTH-2-ITEM-1 PIC X.
               10  DEPTH-2-ITEM-2 PIC 9.
