      * ----------------------------------------------------------------
      * Generated copybook for CUSTOMER-DATA
      * ----------------------------------------------------------------
       01  CUSTOMER-DATA.
           05  CUSTOMER-DATA-FIRST PIC X(160) VALUE 
           'In COBOL, alphanumeric literals cannot exceed one hundred an
      -    'd sixty characters. This is unlike most recent languages whi
      -    'ch do not put limits on strings length .'.
           05  CUSTOMER-DATA-SECOND PIC X(160) VALUE 
           'In COBOL, alphanumeric literals cannot exceed one hundred an
      -    'd sixty characters. This is unlike most recent languages whi
      -    'ch do not put limits on strings length .'.
