       PROGRAM-ID. DPLARCHT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      D01  WS-DEBUG-LINE              PIC S9(8) COMP VALUE ZERO.
       01  WS-NORMAL-LINE             PIC S9(8) COMP VALUE ZERO.
       PROCEDURE DIVISION.
           GOBACK.
