      * ----------------------------------------------------------------
      * Generated copybook for COM-LSFILEAE
      * ----------------------------------------------------------------
       02  COM-LSFILEAE.
           03  COM-NUMBER PIC 9(6).
           03  COM-PERSONAL.
             04  COM-NAME PIC X(20).
             04  COM-ADDRESS PIC X(20).
             04  COM-PHONE PIC X(8).
           03  COM-DATE PIC X(8).
           03  COM-AMOUNT PIC X(8).
           03  COM-COMMENT PIC X(9).
