      * ----------------------------------------------------------------
      * Generated copybook for COM-MSNSEARCH
      * ----------------------------------------------------------------
       01  COM-MSNSEARCH.
           02  Flags--C PIC 9(9) BINARY.
           02  SortBy--C PIC 9(9) BINARY.
           02  ResultFields--C PIC 9(9) BINARY.
           02  R-string--C PIC 9(9) BINARY.
           02  SourceRequest--C PIC 9(9) BINARY.
           02  Request.
             03  AppID PIC X(40) DISPLAY.
             03  Query PIC X(128) DISPLAY.
             03  CultureInfo PIC X(32) DISPLAY.
             03  SafeSearch PIC X(32) DISPLAY.
             03  Flags OCCURS 1 TO 10 DEPENDING ON Flags--C PIC X(32) 
                 DISPLAY.
             03  Location.
               04  Latitude COMP-2.
               04  Longitude COMP-2.
               04  Radius COMP-2.
             03  Requests.
               04  SourceRequest OCCURS 0 TO 10 DEPENDING ON 
                   SourceRequest--C.
                 05  R-Source PIC X(32) DISPLAY.
                 05  Offset PIC 9(9) COMP-5.
                 05  R-Count PIC 9(9) COMP-5.
                 05  FileType PIC X(32) DISPLAY.
                 05  SortBy OCCURS 1 TO 10 DEPENDING ON SortBy--C PIC 
                     X(32) DISPLAY.
                 05  ResultFields OCCURS 1 TO 10 DEPENDING ON 
                     ResultFields--C PIC X(32) DISPLAY.
                 05  SearchTagFilters.
                   06  R-string OCCURS 0 TO 10 DEPENDING ON R-string--C 
                       PIC X(32) DISPLAY.
