      * ----------------------------------------------------------------
      * Generated copybook for COM-LSFILEAE
      * ----------------------------------------------------------------
       01  COM-LSFILEAE.
           02  COM-NUMBER PIC 9(6).
           02  COM-PERSONAL.
               03  COM-NAME PIC X(20).
               03  COM-ADDRESS PIC X(20).
               03  COM-PHONE PIC X(8).
           02  COM-DATE PIC X(8).
           02  COM-AMOUNT PIC X(8).
           02  COM-COMMENT PIC X(9).
