       PROGRAM-ID. DPLARCHT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  W-MINUS-SIGN     PIC X(15).
       01  W-IMBED95NUM     PIC 9(04).
       PROCEDURE DIVISION.
           GOBACK.
