//P390FXMC   JOB  (ACCT#),'FADY',
//*          RESTART=REFRESH,
//           MSGCLASS=X,NOTIFY=&SYSUID,PRTY=14,REGION=0M
//*-------------------------------------------------------
//* COMPILES LSMSGLIB
//*-------------------------------------------------------
//SBPROCS JCLLIB ORDER=CICSTS23.CICS.SDFHPROC
//CMPCON  EXEC DFHYITDL,PROGLIB='P390.DEV.LOAD',
//             LE370HLQ=CEE,
//             INDEX='CICSTS23.CICS',
//             CPARM='RENT,SOURCE,LIST,OFFSET,LONGNAME,DLL',
//             PPARM=DLLNAME(LSMSGLIB),
//             COMPHLQ=CBC,
//             OUTC='*'
//*
//*-------------------------------------------------------
//* CICS TRANSLATION SUBSTITUTIONS
//*-------------------------------------------------------
//TRN.SYSIN DD DISP=SHR,DSN=P390.DEV.C(LSMSGLIB)
//*-------------------------------------------------------
//* COMPILE SUBSTITUTIONS
//*-------------------------------------------------------
//C.SYSLIB  DD
// DD
// DD
// DD
// DD
// DD DISP=SHR,DSN=P390.DEV.H
//*-------------------------------------------------------
//* PRE-LINK SUBSTITUTIONS
//*-------------------------------------------------------
//PLKED.SYSDEFSD DD DSN=P390.DEV.DECK(LSMSGLIB),DISP=SHR
//PLKED.SYSIN  DD
//             DD DISP=SHR,DSN=P390.DEV.DECK(LSCOMLOG)
//*-------------------------------------------------------
//* LINK SUBSTITUTIONS
//*-------------------------------------------------------
//LKED.SYSLIB DD
//     DD
//     DD DISP=SHR,DSN=P390.DEV.LOAD
//LKED.SYSLMOD DD DSN=P390.DEV.LOAD(LSMSGLIB),DISP=SHR
//
