       PROGRAM-ID. DPLARCHT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-EURO-SIGN             PIC €999.99.
       PROCEDURE DIVISION.
           GOBACK.
