       PROGRAM-ID. DPLARCHT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-QUOTES             PIC X(05) VALUE "A'B'C".
       01  WS-APOSTROPHES        PIC X(05) VALUE 'A"B"C'.
       01  WS-QUOTES-PRESERVED   PIC X(05) VALUE "A""B""C".
       01  WS-QUOTES-IMBEDDED    PIC X(05) VALUE "QUOTE".
       PROCEDURE DIVISION.
           GOBACK.
